Autodesk.Revit.DB.FamilySymbol.CanHaveStructuralSection
Identifies if this FamilySymbol can have a structural section.
Returns:
True if the FamilySymbol can have structural section, false otherwise.
Since:
2016

Autodesk.Revit.DB.FamilySymbol.SetStructuralSection(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection)
Sets the structural section in element.
Remarks:
Only beams, braces and structural columns can have a structural section.
To check if the element can have structural section use the Family.HasStructuralSection() method.
structuralSection:
Structural section with values that will be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FamilySymbol cannot have a structural section.
Since:
2015

Autodesk.Revit.DB.FamilySymbol.GetStructuralSection
Gets the structural section from element.
Remarks:
Only beams, braces and structural columns can have a structural section.
To check if the element can have structural section use the Family.HasStructuralSection() method.
Returns:
The structural section. null if the family symbol does not contain a structural section.
Since:
2015

Autodesk.Revit.DB.FamilySymbol.HasThermalProperties
Identifies if this FamilySymbol can include thermal properties.
Returns:
True if the FamilySymbol can include thermal properties, false otherwise.
Since:
2015

Autodesk.Revit.DB.FamilySymbol.SetThermalProperties(Autodesk.Revit.DB.FamilyThermalProperties)
Sets the thermal properties for the given FamilySymbol.
thermalProperties:
The new thermal properties. If null, this unsets custom thermal properties for this FamilySymbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The thermal properties are not valid for assignment.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FamilySymbol does not contain thermal properties.
Since:
2013

Autodesk.Revit.DB.FamilySymbol.GetThermalProperties
Gets the thermal properties for the given FamilySymbol.
Remarks:
Doors, windows, and curtain wall panels will have thermal properties.
Returns:
The thermal properties. null if the family symbol does not contain thermal properties.
Since:
2013

Autodesk.Revit.DB.FamilySymbol.Activate
Activates the symbol to ensure that its geometry is accessible.
Remarks:
Symbols that are not used in the document may be deactivated to conserve memory and regeneration time.
When the symbol is inactive, its geometry is empty and should not be accessed.
In order to access geometry of a symbol that is not active in the document, first check its Autodesk.Revit.DB.FamilySymbol.IsActive
property.  Note that until the document is regenerated, the newly activated symbol's geometry
will still be empty.
Since:
2014

Autodesk.Revit.DB.FamilySymbol.IsActive
Identifies whether the symbol is active.
Remarks:
Symbols that are not used in the document may be deactivated to conserve memory and regeneration time.
When the symbol is inactive, its geometry is empty and cannot be accessed.
In order to access the geometry of a symbol that is not active in the document,
the symbol should first be activated by calling Autodesk.Revit.DB.FamilySymbol.Activate.
Since:
2014

Autodesk.Revit.DB.FamilySymbol.Family
The Family object to which the symbol belongs.

Autodesk.Revit.DB.FamilySymbol.GetFamilyPointLocations
Returns the Point Locations for the Family Symbol.
Remarks: If a family symbol has point references then their locations are returned by this method,
otherwise an empty collection is returned. Examples of FamilySymbol objects that contain point
location are Panels and Flexible Components.
Since: 2011

Autodesk.Revit.DB.FamilySymbol.StructuralMaterialType
This property returns the physical material from which the type is made.
Remarks: Values of this property can be Steel, Concrete, Wood or some other material.

Autodesk.Revit.DB.FamilySymbol
An element that represents a single type with a Family.
Remarks:
Custom families within the Revit API represented by three objects - Family, Autodesk.Revit.DB.FamilySymbol
and Autodesk.Revit.DB.FamilyInstance.
Each object plays a significant part in the structure of families. The Family element represents the entire family
that consists of a collection of types, such as an 'I Beam'. You can think of that object as representing the entire
family file. The Family object contains a number of Autodesk.Revit.DB.FamilySymbol elements. The
Autodesk.Revit.DB.FamilySymbol object represents a specific set
of family settings within that Family and represents what is known in the Revit user interface as a
Type, such as 'W14x32'. The Autodesk.Revit.DB.FamilyInstance object represents an actual instance of that
type placed the Autodesk Revit project. For example the Autodesk.Revit.DB.FamilyInstance would
be a single instance of a W14x32 column within the project.